In [1]:
# programmer : Aditya Rokade
# College : Keystone School of Engineering
# Year  : TE

In [1]:
import pandas as pd

In [5]:
cols = ['Sr No.', 'Name' , 'Year' , 'Marks' , 'Credits']

In [7]:
df = pd.read_csv('datasets/student1.csv' , names = cols)

In [8]:
df

   Sr No.     Name Year  Marks  Credits
0       1     anil   TE  56.77       22
1       2     amit   TE  59.77       21
2       3   aniket   BE  76.88       19
3       4  ajinkya   TE  69.66       20
4       5     asha   TE  63.28       20
5       6   ayesha   BE  49.55       20
6       7     amar   BE  65.34       19
7       8    amita   BE  68.33       23
8       9     amol   TE  56.75       20
9      10    anmol   BE  78.66       21

Slicing  - Index Based (iloc)

In [10]:
x = df.iloc[4:9,1:4]
## format -- > [rows(start:end-1) , col(start:end-1)]

print(x)

     Name Year  Marks
4    asha   TE  63.28
5  ayesha   BE  49.55
6    amar   BE  65.34
7   amita   BE  68.33
8    amol   TE  56.75

In [13]:
x = df.iloc[:,1:4]
print(x)

      Name Year  Marks
0     anil   TE  56.77
1     amit   TE  59.77
2   aniket   BE  76.88
3  ajinkya   TE  69.66
4     asha   TE  63.28
5   ayesha   BE  49.55
6     amar   BE  65.34
7    amita   BE  68.33
8     amol   TE  56.75
9    anmol   BE  78.66

In [14]:
x = df.iloc[3:,1:4]
print(x)

      Name Year  Marks
3  ajinkya   TE  69.66
4     asha   TE  63.28
5   ayesha   BE  49.55
6     amar   BE  65.34
7    amita   BE  68.33
8     amol   TE  56.75
9    anmol   BE  78.66

In [15]:
x = df.iloc[:8,1:4]
print(x)

      Name Year  Marks
0     anil   TE  56.77
1     amit   TE  59.77
2   aniket   BE  76.88
3  ajinkya   TE  69.66
4     asha   TE  63.28
5   ayesha   BE  49.55
6     amar   BE  65.34
7    amita   BE  68.33

In [16]:
x = df.iloc[:,:]
print(x)

   Sr No.     Name Year  Marks  Credits
0       1     anil   TE  56.77       22
1       2     amit   TE  59.77       21
2       3   aniket   BE  76.88       19
3       4  ajinkya   TE  69.66       20
4       5     asha   TE  63.28       20
5       6   ayesha   BE  49.55       20
6       7     amar   BE  65.34       19
7       8    amita   BE  68.33       23
8       9     amol   TE  56.75       20
9      10    anmol   BE  78.66       21

In [17]:
x = df.iloc[4:9]
print(x)

   Sr No.    Name Year  Marks  Credits
4       5    asha   TE  63.28       20
5       6  ayesha   BE  49.55       20
6       7    amar   BE  65.34       19
7       8   amita   BE  68.33       23
8       9    amol   TE  56.75       20

In [18]:
type(x)

pandas.core.frame.DataFrame

In [20]:
# Accessing random rows and columns 

df.iloc[[5,7,2,1],[0,1,3]]

   Sr No.    Name  Marks
5       6  ayesha  49.55
7       8   amita  68.33
2       3  aniket  76.88
1       2    amit  59.77

In [25]:
# accessing single row

df.iloc[5] # or df.iloc[5,: ]  --> row number compulsory

Sr No.          6
Name       ayesha
Year           BE
Marks       49.55
Credits        20
Name: 5, dtype: object

In [27]:
# accessing single column

df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: Name, dtype: object

In [28]:
#exact one row and one col

df.iloc[3,1]

'ajinkya'

Slicing  - Label Based (loc)

In [30]:
df.loc[:,'Name'] # --> col name is used instead of index

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: Name, dtype: object

In [31]:
df.loc[:,['Name' , 'Marks']]

      Name  Marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [37]:
df['Name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: Name, dtype: object

In [36]:
df[['Name','Marks']]

      Name  Marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [40]:
# To access only 1 col and all rows
df.Name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: Name, dtype: object

In [42]:
#accessing rows in specific range

df.iloc[list(range(5)) + list(range(6,10))] # 0 -5 and 6 - 9

   Sr No.     Name Year  Marks  Credits
0       1     anil   TE  56.77       22
1       2     amit   TE  59.77       21
2       3   aniket   BE  76.88       19
3       4  ajinkya   TE  69.66       20
4       5     asha   TE  63.28       20
6       7     amar   BE  65.34       19
7       8    amita   BE  68.33       23
8       9     amol   TE  56.75       20
9      10    anmol   BE  78.66       21

In [46]:
df.drop(5) # dropping 5th row

   Sr No.     Name Year  Marks  Credits
0       1     anil   TE  56.77       22
1       2     amit   TE  59.77       21
2       3   aniket   BE  76.88       19
3       4  ajinkya   TE  69.66       20
4       5     asha   TE  63.28       20
6       7     amar   BE  65.34       19
7       8    amita   BE  68.33       23
8       9     amol   TE  56.75       20
9      10    anmol   BE  78.66       21

In [47]:
df.drop([5,3,1])

   Sr No.    Name Year  Marks  Credits
0       1    anil   TE  56.77       22
2       3  aniket   BE  76.88       19
4       5    asha   TE  63.28       20
6       7    amar   BE  65.34       19
7       8   amita   BE  68.33       23
8       9    amol   TE  56.75       20
9      10   anmol   BE  78.66       21

In [51]:
# using paramter (axis) to drop columns 
## axis = 0 by default (that is rows)
df.drop('Year', axis = 1)

   Sr No.     Name  Marks  Credits
0       1     anil  56.77       22
1       2     amit  59.77       21
2       3   aniket  76.88       19
3       4  ajinkya  69.66       20
4       5     asha  63.28       20
5       6   ayesha  49.55       20
6       7     amar  65.34       19
7       8    amita  68.33       23
8       9     amol  56.75       20
9      10    anmol  78.66       21

In [50]:
df.drop(['Year','Credits'], axis = 1)

   Sr No.     Name  Marks
0       1     anil  56.77
1       2     amit  59.77
2       3   aniket  76.88
3       4  ajinkya  69.66
4       5     asha  63.28
5       6   ayesha  49.55
6       7     amar  65.34
7       8    amita  68.33
8       9     amol  56.75
9      10    anmol  78.66

Functions and Methods

In [52]:
df['Marks'].max()

78.66

In [53]:
df['Marks'].min()

49.55

In [54]:
df['Marks'].mean()

64.499

In [55]:
df['Marks'].sum()

644.9899999999999

In [56]:
df['Name'].max()

'ayesha'

In [57]:
df['Marks'].median()

64.31

In [59]:
df['Marks'].std()
#average distance of each point from the mean

9.207178901994535

In [61]:
df['Year'].value_counts()

Year
TE    5
BE    5
Name: count, dtype: int64

In [64]:
df['Credits'].value_counts()

Credits
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [67]:
df['Year'].mode()

0    BE
1    TE
Name: Year, dtype: object

In [68]:
df['Name'].count()

10

In [70]:
df.min() # --> for whole data frame

Sr No.           1
Name       ajinkya
Year            BE
Marks        49.55
Credits         19
dtype: object

In [72]:
# df.mean() it will throw an error as string is also present in df

df.mean(numeric_only=True)

Sr No.      5.500
Marks      64.499
Credits    20.500
dtype: float64

In [74]:
#sum of rows (not usually useful)

df.sum(numeric_only=True , axis = 1)

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

Function to display Summary of Dataset

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Sr No.   10 non-null     int64
 1   Name     10 non-null     object
 2   Year     10 non-null     object
 3   Marks    10 non-null     float64
 4   Credits  10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [76]:
df.describe()

         Sr No.      Marks    Credits
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000